schedule=[
    ["生物","國防","音樂","英文","體育","數學","物理","無"],#星期一
    ["生物","公民","彈性學習","彈性學習","數學","國文","歷史","數學"],#星期二
    ["英文","數學","物理","國文","資訊","資訊","音樂","國文"],#星期三
    ["公民","國文","國文","體育","歷史","數學","英文","英文"],#星期四
    ["生涯規劃","英文","多元選修","多元選修","彈性學習","班會","社團","無"]#星期五
]
day = str(input("請問要找星期幾的課表 (範例輸入:星期一) : "))
lesson = str(input("請輸入第幾節課 (範例輸入: 第一節) : "))

dic = {"星期一":0,
       "星期二":1,
       "星期三":2,
       "星期四":3,
       "星期五":4,
       "第一節":0,
       "第二節":1,
       "第三節":2,
       "第四節":3,
       "第五節":4,
       "第六節":5,
       "第七節":6,
       "第八節":7,
    }

if day in dic and lesson in dic:
    print("這堂課是: ",schedule[dic[day]][dic[lesson]])
else :
    print("輸入錯誤")